src/Documents/ИС_WB_СборочноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_WB_СборочноеЗадание</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>article</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>convertedPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>isLargeCargo</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderUid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fullAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>longitude</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>latitude</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВВалютеУчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавочныеКоды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>address</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>province</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>area</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>city</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>street</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>home</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>flat</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>entrance</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>longitude</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>latitude</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>offices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>prioritySc</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>skus</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>user</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>fio</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>phone</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_ВБ_ТипыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ВБ_ТипыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBW</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EDBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CnC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FBO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ШтрихкодыУпаковокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыУпаковокТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗначениеШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_WB_СборочноеЗадание/Forms/ФормаКиЗов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #74269
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	Иначе
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Не выбран Профиль");
	КонецЕсли; 
	
	//+ ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
	СтараяФормаУпаковки = Истина;
	
	Если Параметры.Свойство("СтараяФормаУпаковки") Тогда
		СтараяФормаУпаковки = Параметры.СтараяФормаУпаковки;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
	
	Если Параметры.Свойство("СборочныеЗадания") Тогда
		ЗаполнитьТаблицуВыгрузки(Профиль, Параметры.СборочныеЗадания);
	ИначеЕсли Параметры.Свойство("Товары") Тогда
		//+ ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710		
		//ЗаполнитьТаблицуВыгрузкиПослеУпаковки(Параметры.Товары);	
		ЗаполнитьТаблицуВыгрузкиПослеУпаковки(Параметры.Товары, СтараяФормаУпаковки);	
		//- ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Нет данных для выгрузки КиЗов");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #74269 

//+ ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269
&НаКлиенте
Процедура ТаблицаВыгрузкиШтрихкодУпаковкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекДанные = Элементы.ТаблицаВыгрузки.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДанные.КодМаркировки = ВыбранноеЗначение;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269 

//+ ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269

//+ ИнфоСофт Власова И.С. 05.06.24 УА #75912
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	
	Оповестить("ЗакрытиеФормыКиЗовВБ", КодыМаркировкиВыгружены);	
КонецПроцедуры //- ИнфоСофт Власова И.С. 05.06.24 УА #75912

#КонецОбласти

#Область ОбработчикиКомандФормы 

//+ ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #74269
&НаКлиенте
Процедура ВыгрузитьКиЗы(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных для выгрузки");
		Возврат;
	КонецЕсли;
	
	НеЗаполненКиз = Ложь;
	
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		Если Не ЗначениеЗаполнено(Строка.КодМаркировки) Тогда
			НеЗаполненКиз = Истина;  
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НеЗаполненКиз Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьКиЗыЗавершение", ЭтотОбъект, Параметры);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
		НСтр("ru = 'В выгружаемых данных КиЗ должен быть заполнен. Уверены что хотите выгрузить КиЗы?'"), 
		РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ВыгрузитьКиЗыНаСервере();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #74269

//+ ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269
&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ОчиститьСообщения();
	
	ДоступнаИерархия = Ложь;
	
	ИнтеграцияИСКлиент.ОткрытьФормуЗагрузкиКодовМаркировки( ЭтотОбъект,
															ДоступнаИерархия,
															ИнтеграцияИСМПКлиент.ЗаголовокФормыЗагрузкиКодовМаркировки(
															ЭтотОбъект, Истина));
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Мурсалимов Д.Р. 19.04.24 УА #74269
&НаСервере
Процедура ЗаполнитьТаблицуВыгрузки(Профиль, МассивЗаказов)
	
	ТЗ_Заказы = Новый ТаблицаЗначений;
	
	ТЗ_Заказы.Колонки.Добавить("НомерОтправления");
	ТЗ_Заказы.Колонки.Добавить("Заказ1С");
	ТЗ_Заказы.Колонки.Добавить("РеализацияТоваровУслуг");
	ТЗ_Заказы.Колонки.Добавить("Номенклатура");
	ТЗ_Заказы.Колонки.Добавить("Характеристика");
	ТЗ_Заказы.Колонки.Добавить("НомерСтр");
	ТЗ_Заказы.Колонки.Добавить("НоменклатураWB");
	ТЗ_Заказы.Колонки.Добавить("РазмерWB");
	ТЗ_Заказы.Колонки.Добавить("КодМаркировки");
	
	НомерСтр = 1;
	
	ТекНоменклатура = Неопределено;
	ТекХарактеристика = Неопределено;
	ТекРеализацияТоваровУслуг = Неопределено;	
			
	ЗапросРТУ = Новый Запрос;
	
	//+ ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	//+ ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
	//Если ИС_MP_Сервер.ПолучитьВерсиюБезРедакции() >= "5.19.44" Тогда
	ВерсияБезРедации = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ВерсияБезРедации, "5.19.44") >= 0 Тогда
	//- ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
		
		ЗапросРТУ.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ,
		|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
		|	ИС_WB_СборочноеЗадание.НоменклатураWB КАК НоменклатураWB,
		|	ИС_WB_СборочноеЗадание.РазмерWB КАК РазмерWB,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО (ИС_WB_СоответствиеРазмеров.Профиль = ИС_WB_СборочноеЗадание.Профиль)
		|			И (ИС_WB_СоответствиеРазмеров.РазмерWB = ИС_WB_СборочноеЗадание.РазмерWB)
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивЗаказов)
		|	И ИС_WB_СборочноеЗадание.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
		|	И  НЕ ИС_WB_СборочноеЗадание.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыДоставки.FBO)
		//- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслуг,
		|	ВТ_Номенклатура.НоменклатураWB КАК НоменклатураWB,
		|	ВТ_Номенклатура.РазмерWB КАК РазмерWB,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ВТ_Номенклатура.Заказ КАК Заказ,
		|	ВТ_Номенклатура.Номер КАК Номер
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТ_Номенклатура.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|ГДЕ
		|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	ВТ_Номенклатура.НоменклатураWB,
		|	ВТ_Номенклатура.РазмерWB,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		|	ВТ_Номенклатура.Номер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюТовары.Ссылка,
		|	ВТ_Номенклатура.НоменклатураWB,
		|	ВТ_Номенклатура.РазмерWB,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		|	ВТ_Номенклатура.Номер
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
		|		ПО ВТ_Номенклатура.Заказ = ПередачаТоваровХранителюТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = ПередачаТоваровХранителюТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = ПередачаТоваровХранителюТовары.Характеристика
		|ГДЕ
		|	НЕ ПередачаТоваровХранителюТовары.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ПередачаТоваровХранителюТовары.Ссылка,
		|	ВТ_Номенклатура.НоменклатураWB,
		|	ВТ_Номенклатура.РазмерWB,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		|	ВТ_Номенклатура.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
		|	ВТ_РТУ.НоменклатураWB КАК НоменклатураWB,
		|	ВТ_РТУ.РазмерWB КАК РазмерWB,
		|	ВТ_РТУ.Номенклатура КАК Номенклатура,
		|	ВТ_РТУ.Характеристика КАК Характеристика,
		|	ВТ_РТУ.Заказ КАК Заказ,
		|	ВТ_РТУ.Номер КАК Номер
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
	Иначе
		ЗапросРТУ.Текст = 
		"ВЫБРАТЬ
		|	ИС_WB_СборочноеЗадание.Заказ КАК Заказ,
		|	ИС_WB_СборочноеЗадание.Номер КАК Номер,
		|	ИС_WB_СборочноеЗадание.НоменклатураWB КАК НоменклатураWB,
		|	ИС_WB_СборочноеЗадание.РазмерWB КАК РазмерWB,
		|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
		|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
		|		ПО (ИС_WB_СоответствиеРазмеров.Профиль = ИС_WB_СборочноеЗадание.Профиль)
		|			И (ИС_WB_СоответствиеРазмеров.РазмерWB = ИС_WB_СборочноеЗадание.РазмерWB)
		|ГДЕ
		|	ИС_WB_СборочноеЗадание.Ссылка В(&МассивЗаказов)
		|	И ИС_WB_СборочноеЗадание.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И ИС_WB_СоответствиеРазмеров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		//+ ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
		|	И  НЕ ИС_WB_СборочноеЗадание.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ИС_ВБ_ТипыДоставки.FBO)
		//- ИнфоСофт Стояк Ю.К. 04.03.2025 УА #93469
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК РеализацияТоваровУслуг,
		|	ВТ_Номенклатура.НоменклатураWB КАК НоменклатураWB,
		|	ВТ_Номенклатура.РазмерWB КАК РазмерWB,
		|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
		|	ВТ_Номенклатура.Характеристика КАК Характеристика,
		|	ВТ_Номенклатура.Заказ КАК Заказ,
		|	ВТ_Номенклатура.Номер КАК Номер
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТ_Номенклатура.Заказ = РеализацияТоваровУслугТовары.ЗаказКлиента
		|			И ВТ_Номенклатура.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И ВТ_Номенклатура.Характеристика = РеализацияТоваровУслугТовары.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	ВТ_Номенклатура.НоменклатураWB,
		|	ВТ_Номенклатура.РазмерWB,
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.Характеристика,
		|	ВТ_Номенклатура.Заказ,
		|	ВТ_Номенклатура.Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	
	ЗапросРТУ.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапросаКоды = ЗапросРТУ.Выполнить();
	
	ВыборкаРТУ = РезультатЗапросаКоды.Выбрать();
	
	Пока ВыборкаРТУ.Следующий() Цикл
		
		Если ВыборкаРТУ.РеализацияТоваровУслуг = ТекРеализацияТоваровУслуг И ВыборкаРТУ.Номенклатура = ТекНоменклатура И ВыборкаРТУ.Характеристика = ТекХарактеристика Тогда				
			НомерСтр = НомерСтр + 1;	
		Иначе	
			НомерСтр = 1;		
		КонецЕсли;
		
		НоваяСтрока 					= ТЗ_Заказы.Добавить();
		НоваяСтрока.НомерСтр			= НомерСтр;
		НоваяСтрока.НомерОтправления 	= ВыборкаРТУ.Номер;
		НоваяСтрока.Заказ1С 			= ВыборкаРТУ.Заказ;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРТУ, "РеализацияТоваровУслуг,НоменклатураWB,РазмерWB,Номенклатура,Характеристика");
		
		ТекНоменклатура = НоваяСтрока.Номенклатура;
		ТекХарактеристика = НоваяСтрока.Характеристика;
		ТекРеализацияТоваровУслуг = НоваяСтрока.РеализацияТоваровУслуг;
		
	КонецЦикла; 	
	
	РасходныеНакладные = Новый Массив;	
	РасходныеНакладные = ТЗ_Заказы.ВыгрузитьКолонку("РеализацияТоваровУслуг");
	
	Если РасходныеНакладные.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Получение Реализаций по данным заказов завершилось с ошибкой");
	КонецЕсли;
	
	РасходныеНакладные = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РасходныеНакладные);	
	
	ЗапросКоды = Новый Запрос;
	
	//+ ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	//+ ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
	//Если ИС_MP_Сервер.ПолучитьВерсиюБезРедакции() >= "5.19.44" Тогда
	ВерсияБезРедации = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ВерсияБезРедации, "5.19.44") >= 0 Тогда
	//- ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
		
		ЗапросКоды.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК РеализацияТоваровУслуг,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_ШтрихкодУпаковкиРТУ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|ИЗ
		|	Документ.ПередачаТоваровХранителю.ШтрихкодыУпаковок КАК ПередачаТоваровХранителюШтрихкодыУпаковок
		|ГДЕ
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ШтрихкодУпаковкиРТУ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
		|	ВТ_ШтрихкодУпаковкиРТУ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ВТ_ШтрихкодУпаковкиРТУ.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	ВТ_ШтрихкодУпаковкиРТУ.Номенклатура КАК Номенклатура,
		|	ВТ_ШтрихкодУпаковкиРТУ.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_ШтрихкодУпаковкиРТУ КАК ВТ_ШтрихкодУпаковкиРТУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
		
	Иначе
		
		ЗапросКоды.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК РеализацияТоваровУслуг,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В(&МассивРТУ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияТоваровУслуг,
		|	Номенклатура,
		|	Характеристика";
		
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	
	ЗапросКоды.УстановитьПараметр("МассивРТУ", РасходныеНакладные);
	
	РезультатЗапросаКизы = ЗапросКоды.Выполнить();
	
	Выборка_Кизы = РезультатЗапросаКизы.Выбрать();
	
	НомерСтр = 1;
	
	ТекНоменклатура = Неопределено;
	ТекХарактеристика = Неопределено;
	ТекРеализацияТоваровУслуг = Неопределено;
	
	ТЗ_Кизы = Новый ТаблицаЗначений;
	ТЗ_Кизы.Колонки.Добавить("НомерСтр"); 
	ТЗ_Кизы.Колонки.Добавить("РеализацияТоваровУслуг");
	ТЗ_Кизы.Колонки.Добавить("ШтрихкодУпаковки");
	ТЗ_Кизы.Колонки.Добавить("ЗначениеШтрихкода");
	ТЗ_Кизы.Колонки.Добавить("Номенклатура");
	ТЗ_Кизы.Колонки.Добавить("Характеристика");
	
	Пока Выборка_Кизы.Следующий() Цикл
		
		Если Выборка_Кизы.РеализацияТоваровУслуг = ТекРеализацияТоваровУслуг И Выборка_Кизы.Номенклатура = ТекНоменклатура И Выборка_Кизы.Характеристика = ТекХарактеристика Тогда				
			НомерСтр = НомерСтр + 1;	
		Иначе	
			НомерСтр = 1;		
		КонецЕсли;
		
		НоваяСтрока = ТЗ_Кизы.Добавить();	
		НоваяСтрока.НомерСтр = НомерСтр;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка_Кизы);
		
		ТекНоменклатура = НоваяСтрока.Номенклатура;
		ТекХарактеристика = НоваяСтрока.Характеристика;
		ТекРеализацияТоваровУслуг = НоваяСтрока.РеализацияТоваровУслуг;
		
	КонецЦикла;
	
	Для Каждого Строка Из ТЗ_Заказы Цикл 
		
		Отбор = Новый Структура(); 
		
		Отбор.Вставить("НомерСтр", Строка.НомерСтр);
		Отбор.Вставить("Номенклатура", Строка.Номенклатура);
		Отбор.Вставить("Характеристика", Строка.Характеристика);
		
		МассивКизов = ТЗ_КиЗы.НайтиСтроки(Отбор);
		
		Если МассивКизов.Количество() = 0 Тогда
			Продолжить;	
		КонецЕсли;
		
		Для Каждого Элемент Из МассивКизов Цикл 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #80967
			КодМаркировки = ИС_MP_Маркировка.ПолучитьКизНоменклатуры(Элемент);
			
			Строка.КодМаркировки = КодМаркировки;
			//- ИнфоСофт Мурсалимов Д.Р. 05.08.24 УА #80967
			
			ТЗ_КиЗы.Удалить(Элемент);
			
			Прервать;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	Для Каждого Строка Из ТЗ_Заказы Цикл 
		
		НоваяСтрока = ТаблицаВыгрузки.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "НомерОтправления,Номенклатура,Характеристика,КодМаркировки,НоменклатураWB,РазмерWB");
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 19.04.24 УА #74269	

//+ ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #70514
&НаСервере
Процедура ВыгрузитьКиЗыНаСервере()
		
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		МассивВыгрузки = Новый Массив;
		
		Если Не Строка.Выгружен Тогда
			
			Если ЗначениеЗаполнено(Строка.НомерОтправления) И ЗначениеЗаполнено(Строка.КодМаркировки) Тогда	
			
				МассивВыгрузки.Добавить(Строка.КодМаркировки);	
				
				РезультатПрикрепления = ИС_WB_Сервер.ЗакрепитьКиЗыСборочногоЗадания(Профиль, Строка.НомерОтправления, МассивВыгрузки);
				
				Если РезультатПрикрепления = Неопределено Тогда
					Продолжить;
				Иначе
					Строка.Выгружен = Истина;
					
					//+ ИнфоСофт Заварин К.В. 20.02.25 УА #73904
					МассивКодов = Новый Массив;
					
					МассивКодов.Добавить(Строка);
					
					ЗаказМП = Документы.ИС_WB_СборочноеЗадание.НайтиПоНомеру(Строка.НомерОтправления);
					ИС_MP_Сервер.ЗаписатьДанныеКИЗ(Профиль, Перечисления.ИС_МП_Маркетплейсы.ВБ, ЗаказМП, МассивКодов); 	
					//- ИнфоСофт Заварин К.В. 20.02.25 УА #73904
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//+ ИнфоСофт Власова И.С. 05.06.24 УА #75912
	КоличествоВыгруженныхСтрок = ТаблицаВыгрузки.НайтиСтроки(Новый Структура("Выгружен", Истина)).Количество();
	
	Если КоличествоВыгруженныхСтрок = ТаблицаВыгрузки.Количество() Тогда
		КодыМаркировкиВыгружены = Истина;
	КонецЕсли;
	//- ИнфоСофт Власова И.С. 05.06.24 УА #75912
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 20.04.24 УА #70514 

//+ ИнфоСофт Мурсалимов Д.Р. 01.11.23 УА #62673
&НаКлиенте
Процедура ВыгрузитьКиЗыЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда 
		ВыгрузитьКиЗыНаСервере();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка КиЗов отменена!");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 01.11.23 УА #62673 

//+ ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269 
&НаСервере
Процедура ПодобратьКодыНаСервере(КодыМаркировки) 
	
	КодыМаркировкиТЗ = Новый ТаблицаЗначений;
	КодыМаркировкиТЗ.Колонки.Добавить("НормализированныйКод", Новый ОписаниеТипов("Строка"));
	КодыМаркировкиТЗ.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка")); 
	
	Для Каждого Элемент Из КодыМаркировки Цикл
		
		СтрокаТЗ = КодыМаркировкиТЗ.Добавить();
		СтрокаТЗ.НормализированныйКод = Элемент.НормализированныйКод;
		СтрокаТЗ.Код = Элемент.Код;
		
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки,
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_НайденныеКоды
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода В(&МассивКодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ОтсканированныеКоды.Код КАК Строка(300)) КАК Код,
	|	ВЫРАЗИТЬ(ОтсканированныеКоды.НормализированныйКод КАК Строка(300)) КАК НормализированныйКод
	|ПОМЕСТИТЬ ВТ_ОтсканированныеКоды
	|ИЗ
	|	&ОтсканированныеКоды КАК ОтсканированныеКоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НайденныеКоды.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	|	ВТ_НайденныеКоды.Номенклатура КАК Номенклатура,
	|	ВТ_НайденныеКоды.Характеристика КАК Характеристика,
	|	ВТ_ОтсканированныеКоды.Код КАК Код,
	|	ВТ_НайденныеКоды.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_НайденныеКоды КАК ВТ_НайденныеКоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтсканированныеКоды КАК ВТ_ОтсканированныеКоды
	|		ПО ВТ_НайденныеКоды.ЗначениеШтрихкода = ВТ_ОтсканированныеКоды.НормализированныйКод";
	
	Запрос.УстановитьПараметр("МассивКодов", 			КодыМаркировкиТЗ.ВыгрузитьКолонку("НормализированныйКод"));  
	Запрос.УстановитьПараметр("ОтсканированныеКоды", 	КодыМаркировкиТЗ);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По введенным значениям кодов не найдено. Убедитесь, что коды маркировок есть в информационной базе и коды введены корректно без лишних символов(символы переносов строк итд).");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Отбор = Новый Структура(); 
		
		Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
		Отбор.Вставить("Характеристика", Выборка.Характеристика);
		Отбор.Вставить("КодМаркировки", "");
		
		СтрокиВыгрузки = ТаблицаВыгрузки.НайтиСтроки(Отбор);
		
		Если СтрокиВыгрузки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
			
		СтрокиВыгрузки[0].КодМаркировки = Выборка.Код;
		СтрокиВыгрузки[0].ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки;

	КонецЦикла;	
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269

//+ ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
//+ ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269
&НаСервере
//Процедура ЗаполнитьТаблицуВыгрузкиПослеУпаковки(Товары)
Процедура ЗаполнитьТаблицуВыгрузкиПослеУпаковки(Товары, СтараяФормаУпаковки = Истина)
//- ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	//+ ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710	
	//|	Товары.СборочноеЗадание КАК СборочноеЗадание,
	|	Товары.%1 КАК СборочноеЗадание,
	//- ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Киз КАК КодМаркировки,
	|	Товары.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Киз <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.СборочноеЗадание КАК СборочноеЗадание,
	|	ВТ_Товары.СборочноеЗадание.Номер КАК НомерОтправления,
	|	ВТ_Товары.СборочноеЗадание.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Товары.СборочноеЗадание.РазмерWB КАК РазмерWB,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Характеристика КАК Характеристика,
	|	ВТ_Товары.КодМаркировки КАК КодМаркировки,
	|	ВТ_Товары.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	0 КАК ИдентификаторМДЛП,
	|	0 КАК ЧислительУпаковки,	
	|	0 КАК ЗнаминательУпаковки
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары";  
	
	//+ ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710	
	Если СтараяФормаУпаковки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", "СборочноеЗадание");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", "Заказ");
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 09.03.2025 УА #95710
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить()); 
	
	Результатзапроса = Запрос.Выполнить();
	
	Выборка = Результатзапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТЗ = ТаблицаВыгрузки.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
		
	КонецЦикла;	
	
КонецПроцедуры //+ ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269 

//+ ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	КодыМаркировки = Новый Массив;
	
	Для Каждого Строка Из ВыбранноеЗначение Цикл			
		
		РезультатРазбора = ИС_MP_Маркировка.РазборКодаМаркировки(СокрЛП(Строка.Штрихкод));
		
		Если РезультатРазбора <> Неопределено Тогда
			
			ВариантыКодов = Новый Структура;
			ВариантыКодов.Вставить("НормализированныйКод", РезультатРазбора.НормализованныйКодМаркировки);
			ВариантыКодов.Вставить("Код", РезультатРазбора.КодМаркировки);
			
			КодыМаркировки.Добавить(ВариантыКодов);	
			
		КонецЕсли;	
	КонецЦикла;	
	
	Если КодыМаркировки.Количество() = 0 Тогда  
		ОбщегоНазначения.СообщитьПользователю("По введенным значениям кодов не найдено. Убедитесь, что коды маркированной продукции есть в информационной базе и коды введены корректно без лишних символов (символы переносов строк и т.д.)!");	
	Иначе	
		ПодобратьКодыНаСервере(КодыМаркировки);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 02.07.24 УА #74269 

#КонецОбласти
